       01  :DT00:-RECORD.
           03  :DT00:-KEY.
               05  :DT00:-NUM-ORG-X.
                   07  :DT00:-NUM-ORG          PIC 999.
           03  :DT00:-AREA-DADOS.
               05  :DT00:-TXT-LOGR                 PIC X(45).
               05  :DT00:-NUM-LOGR                 PIC X(06).
12345   *      05  :DT00:-NOVES-ALPHABETIC         PIC A(12).
