      ******************************************************************00000100
      *                    COPYBOOK -                                  *00000200
      *----------------------------------------------------------------*00000300
      * DESCRICAO : LAYOUT ARQUIVO CLIENTE CONTA E ENDERECO            *00000400
      *----------------------------------------------------------------*00000600
      *    CAMPOS DE VALOR DEVEM TER SINAL NO IN�CIO DO CAMPO          *00000700
      *    LAYOUT DO ARQUIVO DE:                                       *00000800
      *                                                                *00000900
      *       - 01 = HEADER                                            *00001000
      *       - 02 = DETALHE                                           *00001100
      *       - 99 = TRAILLER                                          *00001200
      *                                                                *00001300
      *                                                                *00002300
      *  TAMANHO: 2500 BYTES                                           *00002400
      ******************************************************************00003300
      *================================================================*00003400
      *                 RECORD DO ARQUIVO                              *00003500
      *================================================================*00003600
       01  :DATA3:-RECORD.                                              00003700
           03  :DATA3:-RXX-TIPO-REG                 PIC 9(002).         00003800
               88 :DATA3:-RXX-HEADER                 VALUE 01.          00003900
               88 :DATA3:-RXX-DETALHE                VALUE 02.          00004000
               88 :DATA3:-RXX-TRAILER                VALUE 99.          00004100
           03  :DATA3:-RXX-FILLER                   PIC X(2498).        00004200
      *================================================================*00004300
      *                 HEADER DO ARQUIVO                              *00004400
      *================================================================*00004500
       01  :DATA3:-HEADER.                                              00004600
           03  :DATA3:-HDR-TIPO-REG                 PIC 9(002).         00004700
               88 :DATA3:-TIPO-HEADER                 VALUE 01.         00004800
           03  :DATA3:-TIPO-ARQUIVO                 PIC X(020).         00004900
      *         TIPO DE ARQUIVO.                                        00005000
           03  :DATA3:-HDR-DTA-GER                  PIC X(010).         00005100
      *         DT GERACAO ARQUIVO AAAA-MM-DD.                          00005200
           03  :DATA3:-HDR-HOR-GER                  PIC X(008).         00005300
      *         HR GERACAO ARQUIVO HH:MM:SS.                            00005400
           03  :DATA3:-COD-ONDA-MIG.                                    00005500
             05  :DATA3:-CODIGO-ONDA                PIC 9(09).          00005600
             05  :DATA3:-DATA-HORA                  PIC X(18).          00005700
      *         CODIGO ONDA MIGRACAO DATA E HORA.                       00005800
           03  FILLER                                 PIC X(2433).      00005900
      *                                                                 00006000
      *================================================================*00006100
      *                   DADOS DETALHE REGISTRO CONTA                 *00006200
      *================================================================*00006300
      *                                                                 00006400
       01 :DATA3:-DETALHE.                                              00006500
         02  :DATA3:-DET-RECORD-DADOS.                                  00006600
           03  :DATA3:-DET-TP-REG                   PIC  9(002).        00006700
               88  :DATA3:-TIPO-DETALHE                VALUE 02.        00006800
           03  :DATA3:-XX-ORG                       PIC 9(03).          00006900
           03  :DATA3:-XX-ACCT                      PIC X(19).          00007000
           03  :DATA3:-XX-DOB                       PIC X(10).          00007100
           03  :DATA3:-XX-NAME-LINE-1               PIC X(40).          00007200
           03  :DATA3:-XX-SSAN                      PIC X(15).          00007300
           03  :DATA3:-VA-ORG-EMIS-DOC              PIC X(08).          00007400
           03  :DATA3:-VA-UF-EXPD-DOCUMENTO         PIC X(02).          00007500
           03  :DATA3:-VA-DATA-EXPEDICAO            PIC X(10).          00007600
           03  :DATA3:-XX-USER-13                   PIC X(30).          00007700
           03  :DATA3:-XX-USER-12                   PIC X(30).          00007800
           03  :DATA3:-XX-POSITION                  PIC X(04).          00007900
           03  :DATA3:-VA-CODIGO-PEP                PIC X(02).          00008000
           03  :DATA3:-XX-NAME-TYPE-IND             PIC 9(01).          00008100
           03  :DATA3:-XX-RELATIVE-NAME             PIC X(40).          00008200
           03  :DATA3:-VA-NOME-CONJUGE              PIC X(40).          00008300
           03  :DATA3:-VA-CPF-CONJUGE               PIC X(11).          00008400
           03  :DATA3:-VA-NUMDOC-CONJUGE            PIC X(13).          00008500
           03  :DATA3:-VA-ORG-EMI-DOC-CONJG         PIC X(10).          00008600
           03  :DATA3:-VA-DAT-EXPD-DOC-CONJG        PIC X(10).          00008700
           03  :DATA3:-VA-DATA-ATU-CONJUGE          PIC X(10).          00008800
           03  :DATA3:-VA-TIPO-DOCUMENTO            PIC X(02).          00008900
           03  :DATA3:-VA-NUM-DOCUMENTO             PIC X(15).          00009000
           03  :DATA3:-VA-POSSUI-PATRIM             PIC X(01).          00009100
           03  :DATA3:-XX-EMPLOYER                  PIC X(40).          00009200
           03  :DATA3:-XX-EMPLOYER-ADDR-1           PIC X(40).          00009300
           03  :DATA3:-XX-EMAIL                     PIC X(60).          00009400
           03  :DATA3:-XX-ACCT                      PIC X(19).          00009500
           03  :DATA3:-XX-CANAL-VENDA-PAN           PIC X(04).          00009600
           03  :DATA3:-XX-DUE-DAY                   PIC 9(02).          00009700
           03  :DATA3:-XX-NUM-CPF-CNPJ              PIC X(14).          00009800
           03  :DATA3:-XX-USER-ACCT-NBR             PIC X(19).          00009900
           03  :DATA3:-XX-NOM-ENDR-ELET             PIC X(60).          00010000
           03  :DATA3:-XX-INCOME                    PIC 9(09).          00010100
           03  :DATA3:-XX-FLAG-ESTATUTARIO          PIC X(01).          00010200
           03  :DATA3:-XX-CRLIM                                         00010300
                                         PIC +99999999999999.99.        00010400
           03  :DATA3:-XX-CANAL-VENDA               PIC X(03).          00010500
           03  :DATA3:-XX-SOURCE                    PIC X(01).          00010600
           03  :DATA3:-XX-DATE-CONVERSION           PIC X(10).          00010700
           03  :DATA3:-XX-LAST-CRLIM                                    00010800
                                         PIC +99999999999999.99.        00010900
           03  :DATA3:-XX-DATE-CRLIM                PIC X(10).          00011000
PERIN*     03  :DATA3:-XX-DATE-LAST-CRLIM           PIC 9(08).          00011100
           03  :DATA3:-XX-DATE-LAST-CRLIM           PIC X(08).          00011100
           03  :DATA3:-XX-PMT-TOT-AMT-DUE                               00011200
                                         PIC +99999999999999.99.        00011300
           03  :DATA3:-XX-PMT-LAST-AMT                                  00011400
                                         PIC +99999999999999.99.        00011500
           03  :DATA3:-XX-CURR-BAL                                      00011600
                                         PIC +99999999999999.99.        00011700
           03  :DATA3:-XX-OPEN-TO-BUY                                   00011800
                                         PIC +99999999999999.99.        00011900
           03  :DATA3:-XX-AMT-LAST-PURCH                                00012000
                                         PIC +99999999999999.99.        00012100
           03  :DATA3:-XX-USER-AMT-1                                    00012200
                                         PIC +99999999999999.99.        00012300
           03  :DATA3:-XX-CASH-CRLIM                                    00012400
                                         PIC +99999999999999.99.        00012500
           03  :DATA3:-XX-DATE-MANUT-FOPA           PIC X(10).          00012600
           03  :DATA3:-XX-COD-TAB-DSCT-FOPA         PIC 9(03).          00012700
           03  :DATA3:-XX-MISC-USER-4               PIC X(11).          00012800
           03  :DATA3:-XX-FIRST-PURCH-DTE           PIC X(10).          00012900
           03  :DATA3:-XX-DATA-MAX-CIP              PIC X(10).          00013000
           03  :DATA3:-XX-ENVIADO-CIP               PIC X(01).          00013100
           03  :DATA3:-XX-AH-AGRMNT-STATUS          PIC X(01).          00013200
           03  :DATA3:-XX-AH-AGRMNT-BROKEN-DT       PIC X(10).          00013300
           03  :DATA3:-XX-VQ-TOT-PGTO-EM-DIA                            00013400
                                         PIC +99999999999999.99.        00013500
           03  :DATA3:-XX-VQ-LAST-PGTO-MIN                              00013600
                                         PIC +99999999999999.99.        00013700
           03  :DATA3:-XX-VP-VIP-TIPO               PIC X(02).          00013800
           03  :DATA3:-XX-VQ-PMT-DAYS-DELQ          PIC 9(03).          00013900
           03  :DATA3:-XX-TROCA-MOEDA-HEDG-SW       PIC X(01).          00014000
           03  :DATA3:-XX-TROCA-MOEDA-HEDG-AMT      PIC 9(05).          00014100
           03  :DATA3:-XX-LAST-CARGA-HEDGE          PIC 9(05).          00014200
           03  :DATA3:-XX-CURR-BAL-HEDGE            PIC 9(09).          00014300
           03  :DATA3:-XX-QTD-CARTAO-RECORR         PIC 9(02).          00014400
           03  :DATA3:-XX-FLAG-FOPA                 PIC X(01).          00014500
           03  :DATA3:-XX-FLG-COMPULS               PIC X(01).          00014600
           03  :DATA3:-XX-FLAG-FAT-ELETR            PIC X(01).          00014700
           03  :DATA3:-XX-DATA-FLAG-FAT-ELETR       PIC X(10).          00014800
           03  :DATA3:-XX-AVAL-EMERG-CREDITO        PIC X(01).          00014900
           03  :DATA3:-XX-DATA-MANUT-AEC            PIC X(10).          00015000
           03  :DATA3:-XX-CODIGO-PRODUTO            PIC 9(03).          00015100
           03  :DATA3:-XX-NUM-CART-TIT              PIC X(19).          00015200
           03  :DATA3:-XX-HASH-CARTAO-TIT           PIC X(19).          00015300
           03  :DATA3:-XX-TIPO-TAB-ANDD             PIC X(01).          00015400
           03  :DATA3:-XX-COD-TAB-ANDD              PIC 9(05).          00015500
           03  :DATA3:-XX-COD-TAB-DSCT              PIC 9(05).          00015600
           03  :DATA3:-XX-NUM-MOT-BLCK-CODE-1       PIC 9(02).          00015700
           03  :DATA3:-XX-SLD-FATURA-PENULT                             00015800
                                         PIC +99999999999999.99.        00015900
           03  :DATA3:-XX-IND-ADSO-PGM-RCMP         PIC X(01).          00016000
           03  :DATA3:-XX-LOGO-GRADE-1              PIC 9(03).          00016100
           03  :DATA3:-XX-LOGO-GRADE-2              PIC 9(03).          00016200
           03  :DATA3:-XX-LOGO-GRADE-3              PIC 9(03).          00016300
           03  :DATA3:-XX-DATE-GRADE-1              PIC X(10).          00016400
           03  :DATA3:-XX-DATE-GRADE-2              PIC X(10).          00016500
           03  :DATA3:-XX-DATE-GRADE-3              PIC X(10).          00016600
           03  :DATA3:-XX-PRODUTO-GRADE-1           PIC 9(05).          00016700
           03  :DATA3:-XX-PRODUTO-GRADE-2           PIC 9(05).          00016800
           03  :DATA3:-XX-PRODUTO-GRADE-3           PIC 9(05).          00016900
           03  :DATA3:-XX-DT-IND-ADSO-PG-RCMP       PIC X(10).          00017000
           03  :DATA3:-XX-STATUS-CPF                PIC X(01).          00017100
           03  :DATA3:-XX-DT-ALT-STATUS-CPF         PIC X(10).          00017200
           03  :DATA3:-XX-TOTAL-CREDITO-CIP                             00017300
                                         PIC +99999999999999.99.        00017400
           03  :DATA3:-XX-ATUALIZA-CIP              PIC X(01).          00017500
           03  :DATA3:-XX-DESC-ANUID                PIC 9(05).          00017600
           03  :DATA3:-XX-CNL-VENDA                 PIC 9(03).          00017700
           03  :DATA3:-XX-NUM-PROTOCOLO             PIC 9(17).          00017800
           03  :DATA3:-XX-CELULA-TESTE              PIC 9(03).          00017900
           03  :DATA3:-XX-ACAO-VENDA                PIC 9(09).          00018000
           03  :DATA3:-XX-FLAG-CTA-MULTIPLA         PIC X(01).          00018100
           03  :DATA3:-XX-STATUS-MULTIPLO           PIC 9(02).          00018200
           03  :DATA3:-XX-DT-ALTER-ST-MULTIPL       PIC X(10).          00018300
           03  :DATA3:-XX-DT-ADESAO-MULTIPLO        PIC X(10).          00018400
           03  :DATA3:-XX-DT-CONCESSAO-CRED         PIC X(10).          00018500
           03  :DATA3:-XX-AG-MULTIPLO               PIC 9(05).          00018600
           03  :DATA3:-XX-CC-MULTIPLO               PIC 9(09).          00018700
           03  :DATA3:-XX-IND-ELEG-MULTIPLO         PIC X(01).          00018800
           03  :DATA3:-XX-IND-CONTA-FUNC            PIC X(01).          00018900
           03  :DATA3:-XX-COD-PACOTE-SMS            PIC 9(02).          00019000
           03  :DATA3:-XX-DAT-PACOTE-SMS            PIC X(10).          00019100
           03  :DATA3:-XX-STATUS-REFIN              PIC 9(02).          00019200
           03  :DATA3:-XX-STATUS-REFIN-PEND         PIC 9(02).          00019300
           03  :DATA3:-XX-DATE-STATUS-REFIN         PIC X(10).          00019400
           03  :DATA3:-XX-DATE-DESBLO-REFIN         PIC X(10).          00019500
           03  :DATA3:-XX-DATE-REFIN-INCONS         PIC X(10).          00019600
           03  :DATA3:-XX-AMT-REFIN-INCONS                              00019700
                                         PIC +99999999999999.99.        00019800
           03  :DATA3:-XX-COD-PRF                   PIC 9(03).          00019900
           03  :DATA3:-XX-NOM-ENDR-ELET-2           PIC X(60).          00020000
           03  :DATA3:-XX-LOGO                      PIC 9(03).          00020100
           03  :DATA3:-XX-SHORT-NAME                PIC X(20).          00020200
           03  :DATA3:-XX-STATE-OF-RESID            PIC 9(03).          00020300
           03  :DATA3:-XX-STATE-OF-ISSUE            PIC 9(03).          00020400
           03  :DATA3:-XX-INT-STATUS                PIC X(01).          00020500
           03  :DATA3:-XX-BLOCK-CODE-1              PIC X(01).          00020600
           03  :DATA3:-XX-BLOCK-CODE-2              PIC X(01).          00020700
           03  :DATA3:-XX-BILLING-CYCLE             PIC 9(02).          00020800
           03  :DATA3:-XX-USER-CODE-7               PIC X(02).          00020900
           03  :DATA3:-XX-USER-CODE-8               PIC X(02).          00021000
           03  :DATA3:-XX-DATE-OPENED               PIC X(10).          00021100
           03  :DATA3:-XX-DATE-BLOCK-CODE-1         PIC X(10).          00021200
           03  :DATA3:-XX-DATE-BLOCK-CODE-2         PIC X(10).          00021300
           03  :DATA3:-XX-DATE-CARD-FEE             PIC X(10).          00021400
           03  :DATA3:-XX-DATE-LAST-PURCH           PIC X(10).          00021500
           03  :DATA3:-XX-DATE-LAST-DELQ            PIC X(10).          00021600
           03  :DATA3:-XX-DATE-LAST-STMT            PIC X(10).          00021700
           03  :DATA3:-XX-DATE-NEXT-STMT            PIC X(10).          00021800
           03  :DATA3:-XX-DATE-PMT-DUE              PIC X(10).          00021900
           03  :DATA3:-XX-DATE-LAST-PMT             PIC X(10).          00022000
           03  :DATA3:-XX-DATE-CARD-EXPR            PIC X(10).          00022100
           03  :DATA3:-XX-CASH-AVAIL-CREDIT                             00022200
                                         PIC +99999999999999.99.        00022300
           03  :DATA3:-XX-VQ-SPM-CYCLE                                  00022400
                                         PIC +99999999999999.99.        00022500
           03  :DATA3:-XX-VQ-SPM-ACCUM                                  00022600
                                         PIC +99999999999999.99.        00022700
           03  :DATA3:-XX-BANDEIRA                  PIC 9(03).          00022800
           03  :DATA3:-XX-VARIANTE                  PIC 9(03).          00022900
           03  :DATA3:-DDD-CELULAR-MG-SMS           PIC X(25).          00023000
           03  :DATA3:-XX-FH-STMT-DATE-1            PIC X(10).          00023100
           03  :DATA3:-XX-FH-STMT-DATE-2            PIC X(10).          00023200
           03  :DATA3:-XX-FH-STMT-DATE-3            PIC X(10).          00023300
           03  :DATA3:-XX-FH-STMT-DATE-4            PIC X(10).          00023400
           03  :DATA3:-XX-FH-STMT-DATE-5            PIC X(10).          00023500
           03  :DATA3:-XX-FH-STMT-DATE-6            PIC X(10).          00023600
           03  :DATA3:-XX-SH-RAW-SCORE-1            PIC 9(03).          00023700
           03  :DATA3:-XX-SH-RAW-SCORE-2            PIC 9(03).          00023800
           03  :DATA3:-XX-SH-RAW-SCORE-3            PIC 9(03).          00023900
           03  :DATA3:-XX-SH-RAW-SCORE-4            PIC 9(03).          00024000
           03  :DATA3:-XX-SH-RAW-SCORE-5            PIC 9(03).          00024100
           03  :DATA3:-XX-SH-RAW-SCORE-6            PIC 9(03).          00024200
           03  :DATA3:-XX-SH-BHV-SCORE-1            PIC 9(03).          00024300
           03  :DATA3:-XX-SH-BHV-SCORE-2            PIC 9(03).          00024400
           03  :DATA3:-XX-SH-BHV-SCORE-3            PIC 9(03).          00024500
           03  :DATA3:-XX-SH-BHV-SCORE-4            PIC 9(03).          00024600
           03  :DATA3:-XX-SH-BHV-SCORE-5            PIC 9(03).          00024700
           03  :DATA3:-XX-SH-BHV-SCORE-6            PIC 9(03).          00024800
           03  :DATA3:-XX-SH-SCO-ID-1               PIC 9(03).          00024900
           03  :DATA3:-XX-SH-SCO-ID-2               PIC 9(03).          00025000
           03  :DATA3:-XX-SH-SCO-ID-3               PIC 9(03).          00025100
           03  :DATA3:-XX-SH-SCO-ID-4               PIC 9(03).          00025200
           03  :DATA3:-XX-SH-SCO-ID-5               PIC 9(03).          00025300
           03  :DATA3:-XX-SH-SCO-ID-6               PIC 9(03).          00025400
           03  :DATA3:-TP-END-OC OCCURS 03 TIMES.                       00025500
             05 :DATA3:-XX-VETOR-ENDR               PIC 9(03).          00025600
             05 :DATA3:-TP-ENDERECO                 PIC X(01).          00025700
               88  :DATA3:-TP-END-RES            VALUE 'R'.             00025800
               88  :DATA3:-TP-END-COM            VALUE 'C'.             00025900
               88  :DATA3:-TP-END-FAT            VALUE 'F'.             00026000
               88  :DATA3:-TP-END-NAO-ENC        VALUE 'N'.             00026100
               88  :DATA3:-TP-END-NAO-INF        VALUE 'I'.             00026200
             05 :DATA3:-XX-NUM-CEP                  PIC X(08).          00026300
             05 :DATA3:-XX-TXT-LOGR                 PIC X(45).          00026400
             05 :DATA3:-XX-NUM-LOGR                 PIC X(06).          00026500
             05 :DATA3:-XX-NOM-BRR                  PIC X(15).          00026600
             05 :DATA3:-XX-TXT-CPL                  PIC X(15).          00026700
             05 :DATA3:-XX-NOM-MNCP                 PIC X(25).          00026800
             05 :DATA3:-XX-NOM-UF                   PIC X(02).          00026900
             05 :DATA3:-XX-NOM-PAIS                 PIC X(20).          00027000
             05 :DATA3:-XX-NUM-TEL-CEL              PIC X(10).          00027100
             05 :DATA3:-XX-NUM-DDD-TEL-CEL          PIC X(04).          00027200
           03 :DATA3:-XX-IND-SEXO                   PIC X(01).          00027300
      *--> F (FEMININO)                                                 00027400
      *--> M (MASCULINO                                                 00027500
      *--> ' ', N ( NAO INFORMADO)                                      00027600
           03 :DATA3:-XX-IND-EST-CIV                PIC 9(01).          00027700
      *--> 1 (CASADO)                                                   00027800
      *--> 2 (SOLTEIRO)                                                 00027900
      *--> 3 (VIUVO)                                                    00028000
      *--> 4 (DESQUITADO/SEPARADO)                                      00028100
      *--> 5 (DIVORCIADO)                                               00028200
      *--> 6 (OUTROS)                                                   00028300
           03  :DATA3:-STATUS-REGISTRO              PIC X(02).          00028400
           03  :DATA3:-FLAG-MOT-EXCLUSAO            PIC 9(02).          00028500
               88  :DATA3:-CONTA-ELEGIV                VALUE 00.        00028600
               88  :DATA3:-CRITIC-PISMO                VALUE 01.        00028700
               88  :DATA3:-CRITIC-NEGOC                VALUE 02.        00028800
               88  :DATA3:-CRITIC-PAR-PG-INCENT        VALUE 03.        00028900
               88  :DATA3:-CRITIC-PAR-ADIC             VALUE 04.        00029000
               88  :DATA3:-CRITIC-PAR-DD-ATR           VALUE 05.        00029100
               88  :DATA3:-CRITIC-PAR-SIT-CTA          VALUE 06.        00029200
               88  :DATA3:-CRITIC-PAR-DEB-AUT          VALUE 07.        00029300
               88  :DATA3:-CRITIC-PAR-ACO-CTA          VALUE 08.        00029400
               88  :DATA3:-CRITIC-PAR-EP-CTA           VALUE 09.        00029500
               88  :DATA3:-CRITIC-PAR-QTD-SEL          VALUE 10.        00029600
               88  :DATA3:-CRITIC-PAR-ORG-ALTER        VALUE 11.        00029700
               88  :DATA3:-CRITIC-PAR-LOGO-ALTER       VALUE 12.        00029800
               88  :DATA3:-CRITIC-CONTA-NAO-ENC        VALUE 13.        00029900
               88  :DATA3:-USO-FUTURO         VALUE 13 THRU 20.         00030000
               88  :DATA3:-VALIDS-COD-ELEG    VALUE 00 THRU 20.         00030100
           03  FILLER                                 PIC X(016).       00030200
         02  :DATA3:-DET-RECORD-COMPL.                                  00030300
           03  :DATA3:-UUID                         PIC X(36).          00030400
           03  :DATA3:-ID-ALTER-CAD-OC OCCURS 250.                      00030500
             05  :DATA3:-ID-ALTERACAO-CAD           PIC X(01).          00030600
           03  FILLER                                 PIC X(43).        00030700
      *                                                                 00030800
           03  :DATA3:-COD-ONDA-MIG-DET             PIC X(27).          00030900
      *         CODIGO ONDA MIGRACAO                                    00031000
      *================================================================*00031100
      *                       TRAILER DO ARQUIVO                       *00031200
      *================================================================*00031300
       01 :DATA3:-TRAILER.                                              00031400
           03  :DATA3:-TRA-TP-REG                   PIC  9(002).        00031500
               88  :DATA3:-TIPO-TRAILER                VALUE 99.        00031600
           03  :DATA3:-QTD-REGIS                    PIC  9(017).        00031700
           03  FILLER                                 PIC  X(2481).     00031800
      *---------------------------------------------------------------* 00031900
      *                      FINAL DO BOOK                            * 00032000
      *---------------------------------------------------------------* 00032100

